var modal = new Vue({
    el: "#modal",
    data: {
        show: false,
        modals: {
            "carrier_help": {
                header: "Как начать работать на грузоперевозках",
                content: `
                    <h3>1. Общая информация</h3>
                    <p>
                        Начать работу на грузоперевозках может каждый игрок. Данная работа заключается в том, чтобы закупать продукты по оптовой цене и развозить их по предприятиям. 
                        Доход с заказов: чем больше продуктов требуется бизнесу, тем прибыльней будет данный заказ.
                    <br/>
                    <h3>2. Задачи грузоперевозчика</h3>
                    <p>
                        Для того, чтобы начать работу, Вам требуется арендовать транспорт и подъехать к маркеру, который расположен около склада. 
                        Далее нужно выбрать заказ и начать его выполнение.
                    </p>
                    </p>
                    <h3>3. Итоги проделанной работы</h3>
                    <p>
                        После того, как вы доставите товар для бизнеса, Вас оповестят об этом в окне уведомлений, где будет написана сумма, которую Вы заработали. 
                        Заработанные деньги придут в Payday. Каждый выполненный заказ повышает ваш навык грузоперевозчика. Чем больше навык, тем больше ресурсов вы можете перевозить.
                    </p>
                    <p>Удачной работы и хорошего заработка!</p>
                `
            },
            "fishing_help": {
                header: "Как начать рыбачить",
                content: `
                    <h3>1. Общая информация</h3>
                    <p>
                        Начать рыбачить может каждый игрок. Данное занятие заключается в том, чтобы ловить рыбу и продавать ее.
                    </p>
                    <br/>
                    <h3>2. Задачи рыбака</h3>
                    <p>
                        Для того чтобы начать рыбачить, Вам требуется купить удочку, затем подойти к любому водоёму (океан или озеро) и закинуть ее. После этого необходимо немного подождать, пока рыба не клюнет и затем сыграть в небольшую мини-игру.
                    </p>
                    <h3>3. Итоги рыбалки</h3>
                    <p>
                        После того, как вы успешно пройдете в мини-игру, вам в инвентарь добавится рыба определенного вида. Каждый вид различается по весу и стоимости, а какая именно попадет вам на крючок, зависит только от вашей удачи.
                    </p>
                    <br/>
                    <p>Удачной рыбалки и хорошего клёва!</p>
                `
            },
            "taxi_help": {
                header: "Как начать работу таксистом",
                content: `
                    <h3>1. Начало работы</h3>
                    <p>
                    Для начала работы таксистом вам потребуется устроиться на работу в таксопарке. Для устройства нужно иметь права категории B.
                    После устройства в таксопарке вам будет доступно приложение для приема заказов.
                    </p>
                    <h3>2. Транспорт</h3>
                    <p>
                    Работать таксистом можно как на личном транспорте, так и на автомобилях таксопарка. Аренда автомобиля таксопарка обойдется вам в $50.
                    Обратите внимание, что принять заказ на мотоцикле/скутере/велосипеде не получится, обязательно нужно использовать автомобиль.
                    </p>
                    <h3>3. Процесс работы</h3>
                    <p>
                    Принять заказ можно в приложении на телефоне. После приема заказа на карте будет отмечена точка, в которой находится клиент.
                    Когда клиент сядет в автомобиль, ему будет предложено выбрать точку на карте. Выбранная точка будет отмечена на карте.
                    После того, как вы доставите клиента в пункт назначения, на ваш банковский счет будет перечислена стоимость поездки за вычетом комиссии таксопарка.
                    </p>
                    <h3>4. Система навыков</h3>
                    <p>
                    С каждым перевезенным клиентом ваш навык таксиста повышается. Навык влияет на размер комиссии таксопарка.
                    Чем больше ваш навык таксиста, тем меньше комиссия таксопарка и выше заработок.
                    </p>
                `
            },
            "bus_help": {
                header: "Как начать работу водителем автобуса",
                content: `
                    <h3>1. Начало работы</h3>
                    <p>
                    Для начала работы водителем автобуса вам потребуется устроиться на работу в автобусном парке.
                    Для устройства нужно иметь лицензию на пассажирский транспорт (категория P).
                    После устройства вы сможете арендовать рабочий транспорт и начать работу на маршруте.
                    </p>
                    <h3>2. Транспорт</h3>
                    <p>
                    Для аренды доступны два вида автобусов - “Coach” и “Rentalbus”. Аренда автобуса обойдется вам в $50.
                    </p>
                    <h3>3. Процесс работы</h3>
                    <p>
                    Чтобы начать работу, нужно сесть в автобус и арендовать его. Вслед за этим откроется меню, в котором вы можете выбрать интересующий вас маршрут
                    и указать цену билета. Билет может быть как платным, так и бесплатным. Учтите, что высокая цена билета может отпугнуть игроков.
                    После выбора маршрута вам потребуется двигаться по чекпоинтам.
                    </p>
                    <h3>4. Зарплата</h3>
                    <p>
                    Ваша зарплата зависит от количества пройденных точек. Также вы будете получать деньги за каждый проданный билет на автобус.
                    Зарплата за точки поступит на ваш счет во время PayDay, а оплата за проданные билеты поступает сразу на руки.
                    </p>
                    <h3>5. Система навыков</h3>
                    <p>
                    Каждая пройденная точка повышает ваш навык водителя автобуса. От навыка зависит бонус к зарплате.
                    Чем больше навык, тем выше сумма бонуса.
                    </p>
                `
            },
            "woodman_help": {
                header: "Как начать работу лесорубом",
                content: `
                    <h3>1. Начало работы</h3>
                    <p>
                    Для начала работы лесорубом вам потребуется приобрести топор на лесопилке.
                    </p>
                    <h3>2. Процесс работы</h3>
                    <p>
                    Чтобы начать работу, нужно подойти к одному из деревьев. Если вы увидите HP дерева, значит его можно добыть.
                    Для этого надо нажимать ЛКМ, пока вы не срубите дерево. Срубленное дерево необходимо порубить на более мелкие бревна, которые вы можете сложить в инвентарь.
                    </p>
                    <h3>3. Продажа дерева</h3>
                    <p>
                    Добытое дерево вы можете продать в порту. Для этого отправляйтесь на точку "Сбыт дерева". Она отмечена коричневым знаком доллара.
                    </p>
                    <h3>4. Система навыков</h3>
                    <p>
                    Каждое срубленное дерево повышает ваш скилл лесоруба. Чем больше скилл, тем больше денег вы получите при продаже бревен.
                    </p>
                `
            },
            "mason_help": {
                header: "Как начать работу каменщиком",
                content: `
                    <h3>1. Начало работы</h3>
                    <p>
                    Для начала работы каменщиком вам потребуется приобрести кирку на каменоломне.
                    </p>
                    <h3>2. Процесс работы</h3>
                    <p>
                    Чтобы начать работу, нужно подойти к одному из камней. Если вы увидите HP камня, значит его можно добыть.
                    Для этого надо нажимать ЛКМ, пока вы не добудете камень.
                    </p>
                    <h3>3. Продажа камня</h3>
                    <p>
                    Добытый камень вы можете продать в порту. Для этого отправляйтесь на точку "Сбыт камня". Она отмечена серым знаком доллара.
                    </p>
                    <h3>4. Система навыков</h3>
                    <p>
                    Каждый добытый камень повышает ваш скилл каменщика. Чем больше скилл, тем больше денег вы получите при продаже камней.
                    </p>
                `
            },
            "builder_help": {
                header: "Как начать работу строителем",
                content: `
                    <h3>1. Процесс работы</h3>
                    <p>
                    Данная работа крайне проста. Ваша задача - переносить грузы со склада по всей территории стройки.
                    Для этого следуйте точкам, появляющимся на карте.
                    </p>
                    <h3>2. Система навыков</h3>
                    <p>
                    Каждый перенесенный груз повышает ваш навык строителя. Чем больше навык, тем выше оплата за каждый груз.
                    </p>
                `
            },
            "orangePicker_help": {
                header: "Как начать работу сборщиком апельсинов",
                content: `
                    <h3>1. Начало работы</h3>
                    <p>
                    Для начала работы сборщиком апельсинов вам не требуется никаких дополнительных инструментов.
                    </p>
                    <h3>2. Процесс работы</h3>
                    <p>
                    Чтобы начать работу, нужно подойти к одному из деревьев на плантации и нажать "E". 
                    Сорванный апельсин попадет к вам в инвентарь.
                    </p>
                    <h3>3. Продажа апельсинов</h3>
                    <p>
                    Собранные апельсины вы можете продать в порту. Для этого отправляйтесь на точку "Сбыт апельсинов". 
                    Она отмечена оранжевым знаком доллара.
                    </p>
                    <h3>4. Система навыков</h3>
                    <p>
                    Каждый собранный апельсин повышает ваш скилл. Чем больше скилл, тем больше денег вы получите при продаже апельсинов.
                    </p>
                `
            },
            "admin_stats": {
                header: "",
                content: ``
            },
        },
        modal: null,
    },
    watch: {
        show(val) {
            if (val) busy.add("modal", true, true);
            else busy.remove("modal", true);
        },
    },
    methods: {
        showByName(name) {
            if (!this.modals[name]) return;
            this.modal = this.modals[name];
            this.show = true;
        }
    },
});

// for tests
// modal.showByName("carrier_help");
